[
[
[
"Name: Программист Python",
"url: https://perm.hh.ru/vacancy/38235729?query=Python",
"company_url: https://perm.hh.ru/employer/44272",
"price: 45 000-45 000 руб.",
"description: Разработка нового, поддержка и актуализация базового функционала систем мониторинга сети. Оптимизация оборудования. Программирование на языках Python/Perl и SQL.Предлагаешь идеи, новые ходы и нестандартные решения. Знание скриптовых языков Python/Perl. Знание SQL и опыт работы с базами данных..."
],
[
"Name: Python developer (Web Development)",
"url: https://perm.hh.ru/vacancy/38222169?query=Python",
"company_url: https://perm.hh.ru/employer/4170568",
"price: ",
"description: Создание собственного продукта для автоматизации бизнеса в международной команде. Разработка frontend и backend новой системы. Интеграция с существующими системами. Опыт разработки на языке Python от 2-х лет. Опыт работы с ReactJS/AngularJS/Vue или иное. Опыт использования технологий..."
],
[
"Name: Эксперт по автоматизированному тестированию (Python)",
"url: https://perm.hh.ru/vacancy/37944325?query=Python",
"company_url: https://perm.hh.ru/employer/1049556",
"price: ",
"description: Активно участвовать в работе scrum-команды. Разрабатывать решений для автоматизированного тестирования на Python (for API/Web/mobile). Проводить автоматизированное Тестирование. Опыт разработки автоматизированных тестов на Python. Знание SQL. Опыт работы с системами CI. Понимание жизненного цикла разработки программного обеспечения. "
],
[
"Name: Data scientist (ML разработчик)",
"url: https://perm.hh.ru/vacancy/37985364?query=Python",
"company_url: https://perm.hh.ru/employer/974305",
"price: ",
"description: Решение задач распознавания и классификации графических образов в видеопотоке с помощью нейронных сетей. Выдвижение и проверка гипотез с помощью машинного...Понимание и практический опыт использования нейронных сетей. Инструменты: Python, C++, Tensorflow (Keras), Darknet. Математика: статистика, теория вероятностей, математический анализ, линейная..."
],
[
"Name: Системный/младший администратор (DevOps / Поддержка)",
"url: https://perm.hh.ru/vacancy/38212195?query=Python",
"company_url: https://perm.hh.ru/employer/2404589",
"price: ",
"description: Фронтенд: JavaScript, ReactJS, ReactNative. Бэкенд: PHP + Java + PostgresSQL + MSSQL. Инфраструктура: Centos/RedHat + немного Windows. Опыт использования и желание развиватьcя в администрировании GNU/Linux дистрибутивов. Терпимое отношение к Windows. Базовые знания по работе сетей. "
],
[
"Name: Специалист по тестированию ПО",
"url: https://perm.hh.ru/vacancy/38044568?query=Python",
"company_url: https://perm.hh.ru/employer/2446838",
"price: 35 000-70 000 руб.",
"description: Разработка программ и скриптов автоматизированного тестирования (groovy в SOAP UI, javascript в Postman, самостоятельные программы на java или python). Умение создавать небольшие скрипты на одном из современных языков программирования: javascript / python / groovy / java. Опыт работы в команде по гибкой..."
],
[
"Name: Программист С++",
"url: https://perm.hh.ru/vacancy/38098245?query=Python",
"company_url: https://perm.hh.ru/employer/3590170",
"price: 40 000-90 000 руб.",
"description: разработка и сопровождение программ Qt."
],
[
"Name: Разработчик Backend",
"url: https://perm.hh.ru/vacancy/37614566?query=Python",
"company_url: https://perm.hh.ru/employer/2910384",
"price: ",
"description: "
],
[
"Name: Аналитик",
"url: https://perm.hh.ru/vacancy/38204216?query=Python",
"company_url: https://perm.hh.ru/employer/3674838",
"price: ",
"description: Анализ источников данных на предмет использования в системе принятия решений. Разработка прогностических моделей (в том числе в формате скоринговых карт...Высшее математическое или физическое образование. Знание языков Python или R. Опыт работы с базами данных MySQL, PostgreSql. Умение работать как..."
],
[
"Name: Разработчик backend",
"url: https://perm.hh.ru/vacancy/38304028?query=Python",
"company_url: https://perm.hh.ru/employer/981",
"price: ",
"description: Разработка бизнес-логики и back-end системы для поддержки мобильного продукта. Создание функциональных API. Организация серверного окружения, включая администрирование баз...Опыт back-end разработки (Python), наличие портфолио. Опыт работы с одним или несколькими фреймворками. Навык работы с Git. "
],
[
"Name: Специалист по тестированию (г. Екатеринбург)",
"url: https://perm.hh.ru/vacancy/36973924?query=Python",
"company_url: https://perm.hh.ru/employer/1947330",
"price: ",
"description: Проведение модульного, регрессионного, интеграционного тестирования. Тематика деятельности: депозитно-кредитные операции, финансовые рынки - рынок ценных бумаг, акций, производных финансовых инструментов, валютный...Навыки коммуникаций с заказчиками и смежными подразделениями при согласовании документов. Опыт работы с Selenium, навыки написания автотестов на Python, знание..."
],
[
"Name: Разработчик C#",
"url: https://perm.hh.ru/vacancy/36391039?query=Python",
"company_url: https://perm.hh.ru/employer/823393",
"price: ",
"description: Команда проекта Playkey в поиске программиста C# для разработки системы биллинга (система управления подключениями пользователей). - разрабатывать связующий компонент систем Playkey. - знание JavaScript, TypeScript, Python, C++. - знание основ шифрования данных. - опыт оптимизации SQL запросов. - опыт работы с OLAP. - опыт работы с..."
],
[
"Name: Fullstack разработчик",
"url: https://perm.hh.ru/vacancy/38277830?query=Python",
"company_url: https://perm.hh.ru/employer/44272",
"price: ",
"description: Разработка бэкенд системы на Python. Писать pipeline’ы обработки данных в Spark(scala, pyspark) либо на Python/Golang. Опыт разработки на Python от 2 лет. Опыт разработки на Javascript, React/Redux. Отличное знание SQL. Практический опыт работы с..."
],
[
"Name: Инженер-программист",
"url: https://perm.hh.ru/vacancy/34129980?query=Python",
"company_url: https://perm.hh.ru/employer/978368",
"price: ",
"description: Поддержка и программирование в 1С (8.3 обычные формы), ПО Фронтол (кассовая система). Настройка и поддержка торгового оборудования (сканеры...Вашим преимуществом будет: умение программировать в 1С, знание какого-либо языка программирования кроме 1С (python, javascript, c#, java)."
],
[
"Name: Разработчик системы видео-регистрации",
"url: https://perm.hh.ru/vacancy/38303925?query=Python",
"company_url: https://perm.hh.ru/employer/2413968",
"price: ",
"description: Разработка новой функциональности и новых модулей. Рефакторинг существующего кода. Интеграция с другими сервисами.Знания алгоритмов и структур данных. Знание языков Java/C++ и Python. Опыт работы или базовые знания OC Linux. "
],
[
"Name: Senior Frontend Engineer (Canvas Widgets)",
"url: https://perm.hh.ru/vacancy/37939660?query=Python",
"company_url: https://perm.hh.ru/employer/1084619",
"price: ",
"description: As a Senior Frontend Engineer at Miro, you'll be an impactful contributor to the technical design and development of...Maven, Git, Jira, Confluence, Bamboo, BitBucket. Work on meaningful things. We mean it. If something doesn’t make sense to..."
],
[
"Name: Ведущий Frontend-разработчик (компания Promobot)",
"url: https://perm.hh.ru/vacancy/37553499?query=Python",
"company_url: https://perm.hh.ru/employer/3903645",
"price: ",
"description: Разработка продуктов на JavaScript, Vue (Vuex). Верстка приложений и компонентов. Подключение JS API робота и внешних API. Проектирование архитектуры приложений. Опыт работы с базами данных. Знание linux. Опыт использования node.js, npm, webpack. Будет плюсом опыт работы с docker и python..."
],
[
"Name: Продуктовый аналитик",
"url: https://perm.hh.ru/vacancy/35703596?query=Python",
"company_url: https://perm.hh.ru/employer/2076464",
"price: ",
"description: Формировать и декомпозировать продуктовые метрики в дерево метрик. Налаживать сбор этих метрик, их сегментирование и визуализацию. Контролировать текущие значения метрик...Уверенное владение инструментами для анализа данных. Python (matplotlib, pandas, numpy,Spyder, Jupyter). R (dplyr, ggplot2, R markdown). "
],
[
"Name: Разработчик систем дистанционного банковского обслуживания",
"url: https://perm.hh.ru/vacancy/38314333?query=Python",
"company_url: https://perm.hh.ru/employer/688499",
"price: ",
"description: Разработка новой функциональности интернет-банка для юридических лиц.Знание MS/MY SQL, C++, PHP, HTML5,PHP/Python, JS. - Опыт работы с системами ДБО, web-разработки, разработки мобильных..."
],
[
"Name: Старший специалист по управлению витринами данных",
"url: https://perm.hh.ru/vacancy/37993209?query=Python",
"company_url: https://perm.hh.ru/employer/44272",
"price: до 50 000 руб.",
"description: Организация сбора и обработки данных из различных источников. Определение требований к перечню, объему и качеству данных, необходимых для решения бизнес...Опыт разработки бизнес-функциональных требований, спецификаций, технических заданий и другой проектной документации. Опыт работы с инструментами статистического анализа данных (Python..."
],
[
"Name: Специалист по адаптации игрового контента",
"url: https://perm.hh.ru/vacancy/37667286?query=Python",
"company_url: https://perm.hh.ru/employer/823393",
"price: ",
"description: Писать скрипты для запуска (Python), добавлять игры в автоапдейтер, проверять наличие необходимых таблиц в БД у игры. Поддерживать игры и...Большой игровой опыт (чтобы адаптировать игры, нужно играть в них самому). Знание SQL и Python. Английский не ниже intermediate. "
],
[
"Name: Портфельный менеджер отдела управления рисками",
"url: https://perm.hh.ru/vacancy/38301692?query=Python",
"company_url: https://perm.hh.ru/employer/688499",
"price: 40 000-40 000 руб.",
"description: Расчет резервов МСФО 9. Расчёт риск-метрик (PD, LGD, NPL). Взаимодействие с БКИ. Мониторинг кредитного портфеля. Формирование управленческой отчётности.Знание 611-П, 590-П, 218-ФЗ, МСФО9. Знание SQL как преимущество (написание простых запросов). Основы мат. моделирования. "
],
[
"Name: Backend-разработчик (CDN)",
"url: https://perm.hh.ru/vacancy/38202901?query=Python",
"company_url: https://perm.hh.ru/employer/2707491",
"price: ",
"description: Разработка и поддержка функционала продукта CDN. Участие в разработке архитектуры (совместно с другими разработчиками и архитекторами). Поиск и устранение багов. Мышление на перспективу и проактивность. Имеешь опыт коммерческой разработки на Python3 более 1 года. Работал c Django, DRF, PostgreSQL. "
],
[
"Name: Программист-аналитик (Python)",
"url: https://perm.hh.ru/vacancy/37599433?query=Python",
"company_url: https://perm.hh.ru/employer/823709",
"price: ",
"description: Облегчать жизнь сотрудникам внутри компании, для этого необходимо: - Общаться с заказчиками для сбора информации по имеющимся процессам и погружения в...Создавать алерты на основе данных. Высшее образование. Хороший математический и статистический бэкграунд. Python - уровень для уверенной работы с данными - их..."
],
[
"Name: Инженер IT-проектов (г.Тюмень)",
"url: https://perm.hh.ru/vacancy/37803625?query=Python",
"company_url: https://perm.hh.ru/employer/588180",
"price: ",
"description: Разработка проектных решений по ИТ, формирование конечного предложения и ТЭО. Составление, планирование, согласование и контроль проектов. Координация работ, производимых в...Опыт работы с системами виртуализации – Hyper-V. Обязательное знание языка Python. Опыт и навыки написания скриптов. Понимание принципов процессов эксплуатации..."
],
[
"Name: Backend developer (Payments)",
"url: https://perm.hh.ru/vacancy/37783411?query=Python",
"company_url: https://perm.hh.ru/employer/823709",
"price: ",
"description: Backend: PHP 7.1 (Symfony, Doctrine), Go. Разрабатывать функционал продукта Xsolla Pay Station и поддерживать его. Предлагать новые идеи по......Go (или любом другом серверном объектном языке: Java, C#, Ruby, python и т.д.). Хорошо понимаешь алгоритмы и структуры данных. "
],
[
"Name: Back-end разработчик (Сочи)",
"url: https://perm.hh.ru/vacancy/38170236?query=Python",
"company_url: https://perm.hh.ru/employer/1326",
"price: ",
"description: Проектирование, разработка и развитие пилотных и продуктивных систем с применением технологии блокчейн. Исследование и пробное использование блокчейн платформ и решений.Хорошее знание одного из языков: Golang, Java, Javascript, C++, Rust, Python. Хорошее понимание стандартных алгоритмов, структур данных, принципов и паттернов..."
],
[
"Name: DevOps specialist",
"url: https://perm.hh.ru/vacancy/38174861?query=Python",
"company_url: https://perm.hh.ru/employer/823709",
"price: ",
"description: Администрирование Google Cloud Platform, Terraform. Развитие в направлении GitOps. Автоматизация задач администрирования: Работа с системой управления конфигурациями: автоконфигурирование, шаблонизация серверов...Опыт программирования на скриптовых языках (Bash, Python и т.д.). Опыт администрирования ОС Linux. Отличное знание Git. Знание продуктов Atlassian..."
],
[
"Name: Backend разработчик",
"url: https://perm.hh.ru/vacancy/38129394?query=Python",
"company_url: https://perm.hh.ru/employer/44272",
"price: ",
"description: Языки разработки: Java (в основном), некоторые части сервиса написаны на Python и Go. Системы мониторинга и сбора метрик: DataDog, Graylog...Высшее образование (техническое). Опыт разработки на JAVA, знание других языков программирования будет преимуществом. Опыт разработки и внедрения архитектурных решений для..."
],
[
"Name: Администратор баз данных",
"url: https://perm.hh.ru/vacancy/38158279?query=Python",
"company_url: https://perm.hh.ru/employer/11749",
"price: ",
"description: Поддержка промышленных и тестовых сред на базе СУБД Oracle/PostgreSQL. Установка \"с нуля\", клонирование, настройка вышеуказанных продуктов. Участие в аварийно...Базовые навыки автоматизации задач администрирования систем на shell, bash, python. Стремление к самообразованию, инициативность, ответственность. Знание английского языка – умение читать..."
],
[
"Name: Специалист в команду технической поддержки партнеров Авто.ру",
"url: https://perm.hh.ru/vacancy/38149477?query=Python",
"company_url: https://perm.hh.ru/employer/1740?dpt=yandex-1740-yandex",
"price: ",
"description: Общаться с клиентами и подключать их к нашему сервису. Выгружать XML-файлы (фиды) для наших клиентов-дилеров. Решать технические проблемы...Опыт работы в CRM. Знание марок и модификаций автомобилей. Базовые знания python. Базовые знания работы с api. Готовность выполнить тестовое..."
],
[
"Name: DevOps-инженер",
"url: https://perm.hh.ru/vacancy/38098999?query=Python",
"company_url: https://perm.hh.ru/employer/3144945",
"price: от 65 000 руб.",
"description: Развитие и поддержка DevOps-инфраструктуры нескольких крупных проектов, над которыми работает 150+ человек. Администрирование систем, обеспечивающих процессы DevOps/CI...Желательно высшее или среднее профессиональное образование в ИТ сфере, могут рассматриваться кандидаты с незаконченным высшим и профильным опытом. "
],
[
"Name: Аналитик данных (data analyst/data scientist)",
"url: https://perm.hh.ru/vacancy/37860029?query=Python",
"company_url: https://perm.hh.ru/employer/2700198",
"price: ",
"description: Выстраивание отношений с заказчиком. Регулярные внешние коммуникации. Участие в сдаче промежуточных и конечных результатов. 2. Участие в процессе разработки приложений. Профильное высшее образование. Опыт применения Python / R / Spark в прикладных задачах. Владение английским языком на уровне Intermediate и выше будет..."
],
[
"Name: Senior Engineer Cyber Security",
"url: https://perm.hh.ru/vacancy/37225029?query=Python",
"company_url: https://perm.hh.ru/employer/6769",
"price: ",
"description: Develop scripts, tools and methodologies to continuously monitor cloud security. Find and help remediate deviations from internal security policies and...Strong programming and scripting skills in several programming languages, including Java, JavaScript and Python. Experience in working with agile methodologies. "
],
[
"Name: Руководитель отдела эксплуатации бизнес приложений ( в г. Екатеринбурге)",
"url: https://perm.hh.ru/vacancy/37085921?query=Python",
"company_url: https://perm.hh.ru/employer/1151579",
"price: ",
"description: Организация единого центра поддержки бизнес приложений в Холдинге. Операционное руководство отделом эксплуатации бизнес приложений. Подбор персонала, мотивация, обучение и развитие...Знание языков программирования C++, Delphi, Python – желательно. Опыт работы с программными продуктами, обеспечивающими производственную и иную деятельность аэропортов – очень желательно. "
],
[
"Name: Backend-разработчик (DDoS Protection)",
"url: https://perm.hh.ru/vacancy/37085744?query=Python",
"company_url: https://perm.hh.ru/employer/2707491",
"price: ",
"description: Разрабатывать и поддерживать функционал продукта компании DDoS Protection на базе Mitigator/Varity. Участвовать в разработке архитектуры (совместно с другими разработчиками...Работал с Python 3, Django, DRF. Отлично знаешь ООП. Можешь читать техническую документацию на английском языке. Имеешь опыт работы с..."
],
[
"Name: Tech Lead (Anti-Fraud)",
"url: https://perm.hh.ru/vacancy/38088610?query=Python",
"company_url: https://perm.hh.ru/employer/823709",
"price: ",
"description: Руководить разработкой продукта: Осуществлять постановку задач. Планировать и контролировать процесс разработки. Оценивать сроки реализации отдельных задач. Организовывать и фасилитировать Scrum...Опыт разработки и понимание техстека Golang, Python, PostgreSQL, микросервисной архитектуры. Понимание гибких методологий управления проектами: Scrum, Agile. Имеете опыт управления..."
],
[
"Name: PHP developer",
"url: https://perm.hh.ru/vacancy/36915955?query=Python",
"company_url: https://perm.hh.ru/employer/939343",
"price: ",
"description: Десятки реализованных проектов федерального уровня с применением BigData, Programmatic в области рекламы. Платформу по реализации VaS услуг, мобильных сервисов и...Опыт разработки в телекоме. Знание языков: Python. Умение обращаться с хранилищами данных: MongoDB, Redis, Tarantool, Memcached. Знание технологий: Gearman, RabbitMQ..."
],
[
"Name: Специалист по тестированию (автотестированию)",
"url: https://perm.hh.ru/vacancy/37918709?query=Python",
"company_url: https://perm.hh.ru/employer/3144945",
"price: ",
"description: Разработкой тест-кейсов и валидацией постановок на тестируемость. Функциональным, интеграционным, регрессионным тестированием. Разработкой программ и скриптов автоматизированного тестирования. Умения создавать небольшие скрипты на одном из современных языков. программирования: javascript / python / groovy / java. Опыт работы в команде по гибкой..."
],
[
"Name: DevOps Engineer",
"url: https://perm.hh.ru/vacancy/36410123?query=Python",
"company_url: https://perm.hh.ru/employer/1084619",
"price: ",
"description: Maintain and improve the CI/CD process in the engineering team. Maintain engineering tools. Automate operations tasks. Work closely with...2+ years in System Administration. Knowledge of script programming languages (Python). Knowledge of configuration languages (Ansible). Knowledge of professional..."
],
[
"Name: Product Data Analyst",
"url: https://perm.hh.ru/vacancy/37086765?query=Python",
"company_url: https://perm.hh.ru/employer/1084619",
"price: ",
"description: Rolling-out ‘data-as-a-service’ approach for Product teams to make data easy to access, understand and make decisions. English language skills at upper intermediate level (or higher). Programming skills in R/Python. Experience in collaboration with data engineers..."
],
[
"Name: Backend-разработчик (Разработка биллинговых систем)",
"url: https://perm.hh.ru/vacancy/37367704?query=Python",
"company_url: https://perm.hh.ru/employer/2707491",
"price: ",
"description: Разработка и поддержка функционала биллинга. Участие в разработке архитектуры (совместно с другими разработчиками и архитекторами). Поиск и устранение багов. Работал с Python 3, Django, DRF, PostgreSQL и имеешь практический опыт их применения в реальных рабочих задачах (не pet projects..."
],
[
"Name: Data Engineer",
"url: https://perm.hh.ru/vacancy/36301833?query=Python",
"company_url: https://perm.hh.ru/employer/67181",
"price: ",
"description: Объединение потоков данных. Консолидация данных в едином хранилище. Подготовка данных к последующей аналитике и использованию в сервисах компании.Опыт разработки распределенных вычислений в рамках Hadoop на Python, Java, Scala. Опыт администрирования OC Linux. Навыки работы с Docker, Rancher..."
],
[
"Name: Java-разработчик",
"url: https://perm.hh.ru/vacancy/37791087?query=Python",
"company_url: https://perm.hh.ru/employer/44272",
"price: ",
"description: Языки разработки: Java (в основном), некоторые части сервиса написаны на Python и Go. Системы мониторинга и сбора метрик: DataDog, Graylog...Опыт разработки backend-приложений на Java. Умение работать с реляционными СУБД. Практический опыт работы с операционными системами семейства *nix. "
],
[
"Name: Backend-программист",
"url: https://perm.hh.ru/vacancy/37812052?query=Python",
"company_url: https://perm.hh.ru/employer/913078",
"price: 50 000-80 000 руб.",
"description: Разработка back-end части высоконагруженного SAAS-сервиса. - Контроль выполненной работы. - Обеспечение масштабируемости кода. Требования: - От 1 года разработки на PHP...Способность разобраться и поддерживать чужой код, полноценно работать в команде. - Несомненным плюсом будет знание других языков и фреймворков (python (django..."
]
]
]